
//=============================================
//=
//=	ゲームモード [gameMode.cpp]
//=	Author:Sakai Minato
//=
//=============================================

#include "main.h"
#include "gameMode.h"

#include "object2D.h"

//=======================================
//=	静的変数宣言
//=======================================

CModeGame* CModeGame::m_pInstance = nullptr;

//=================================================================
//= ゲームモードの基底クラス
//=================================================================
//---------------------------------------------------------
//- コンストラクタ
//---------------------------------------------------------
CModeGame::CModeGame()
{
	m_modeGame = MODE_GAME(0);
}

//---------------------------------------------------------
//- デストラクタ
//---------------------------------------------------------
CModeGame::~CModeGame()
{

}

//---------------------------------------------------------
//- モード設定処理
//---------------------------------------------------------
void CModeGame::SetMode(MODE_GAME modeGame)
{
	if (m_pInstance != nullptr)
	{
		// 終了処理
		m_pInstance->Uninit();
		delete m_pInstance;
		m_pInstance = nullptr;
	}

	switch (modeGame)
	{
	case CModeGame::MODE_GAME_NONE:
		break;
		
	case CModeGame::MODE_GAME_SEARCH:	// 探索モード
		
		// 生成処理
		m_pInstance = CModeSearch::Create();

		break;

	case CModeGame::MODE_GAME_BATTLE:	// 戦闘モード

		// 生成処理
		m_pInstance = CModeBattle::Create();

		break;

	default:
		break;
	}
}

//=================================================================
//= ゲームモードの探索クラス
//=================================================================
//---------------------------------------------------------
//- コンストラクタ
//---------------------------------------------------------
CModeSearch::CModeSearch()
{
	m_pTest2d = nullptr;
}

//---------------------------------------------------------
//- デストラクタ
//---------------------------------------------------------
CModeSearch::~CModeSearch()
{

}

//---------------------------------------------------------
//- 生成処理
//---------------------------------------------------------
CModeSearch* CModeSearch::Create(void)
{
	// 生成
	CModeSearch* pInstance = new CModeSearch;

	// 初期化処理
	if (FAILED(pInstance->Init()))
	{//初期化処理が失敗した場合
		return nullptr;
	}

	return pInstance;
}

//---------------------------------------------------------
//- 初期化処理
//---------------------------------------------------------
HRESULT CModeSearch::Init(void)
{
	// テスト2Dを生成
	m_pTest2d = CObject2D::Create();

	if (m_pTest2d != nullptr)
	{
		m_pTest2d->SetPos(SCREEM_CENTER);
	}

	return S_OK;
}

//---------------------------------------------------------
//- 終了処理
//---------------------------------------------------------
void CModeSearch::Uninit(void)
{
	if (m_pTest2d != nullptr)
	{
		// 終了処理
		m_pTest2d->Uninit();
	}
}

//=================================================================
//= ゲームモードの戦闘クラス
//=================================================================
//---------------------------------------------------------
//- コンストラクタ
//---------------------------------------------------------
CModeBattle::CModeBattle()
{

}

//---------------------------------------------------------
//- デストラクタ
//---------------------------------------------------------
CModeBattle::~CModeBattle()
{

}

//---------------------------------------------------------
//- 生成処理
//---------------------------------------------------------
CModeBattle* CModeBattle::Create(void)
{
	// 生成
	CModeBattle* pInstance = new CModeBattle;

	// 初期化処理
	if (FAILED(pInstance->Init()))
	{//初期化処理が失敗した場合
		return nullptr;
	}

	return pInstance;
}

//---------------------------------------------------------
//- 初期化処理
//---------------------------------------------------------
HRESULT CModeBattle::Init(void)
{
	return S_OK;
}

//---------------------------------------------------------
//- 終了処理
//---------------------------------------------------------
void CModeBattle::Uninit(void)
{
}