//============================================
//
//	キューブスピン [CubeSpin.cpp]
//	Author:sakamoto kai
//
//============================================
#include "joyconbox.h"
#include "input.h"
#include "renderer.h"
#include "manager.h"
#include "game.h"
#include "texture.h"
#include "object3D.h"

//====================================================================
//コンストラクタ
//====================================================================
CJoyconBox::CJoyconBox(int nPriority) :CObject(nPriority)
{
	m_pos = INITVECTOR3;
	m_move = INITVECTOR3;
	m_fSpinDistance = 0.0f;
	m_fSpinDisMove = 0.0f;
	m_fSpinSpeed = D3DXVECTOR3(-100.0f, -100.0f, -100.0f);
}

//====================================================================
//デストラクタ
//====================================================================
CJoyconBox::~CJoyconBox()
{

}

//====================================================================
//生成処理
//====================================================================
CJoyconBox* CJoyconBox::Create()
{
	CJoyconBox* pObject3D = NULL;

	if (pObject3D == NULL)
	{
		//オブジェクト3Dの生成
		pObject3D = new CJoyconBox();
	}

	//オブジェクトの初期化処理
	if (FAILED(pObject3D->Init()))
	{//初期化処理が失敗した場合
		return NULL;
	}

	return pObject3D;
}

//====================================================================
//初期化処理
//====================================================================
HRESULT CJoyconBox::Init(void)
{
	SetType(TYPE_CUBESPIN);

	return S_OK;
}

//====================================================================
//終了処理
//====================================================================
void CJoyconBox::Uninit(void)
{
	SetDeathFlag(true);
}

//====================================================================
//更新処理
//====================================================================
void CJoyconBox::Update(void)
{
	m_pos += m_move;
}

//====================================================================
//描画処理
//====================================================================
void CJoyconBox::Draw(void)
{

}